SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_emu.h
/* Bit fields for EMU DGIEN */
#define _EMU_DGIEN_RESETVALUE                   0x00000000UL                            /**< Default value for EMU_DGIEN                 */
#define _EMU_DGIEN_MASK                         0xE1000000UL                            /**< Mask for EMU_DGIEN                          */
#define EMU_DGIEN_EM23WAKEUPDGIEN               (0x1UL << 24)                           /**< EM23 Wake up Interrupt enable               */
#define _EMU_DGIEN_EM23WAKEUPDGIEN_SHIFT        24                                      /**< Shift value for EMU_EM23WAKEUPDGIEN         */
#define _EMU_DGIEN_EM23WAKEUPDGIEN_MASK         0x1000000UL                             /**< Bit mask for EMU_EM23WAKEUPDGIEN            */
#define _EMU_DGIEN_EM23WAKEUPDGIEN_DEFAULT      0x00000000UL                            /**< Mode DEFAULT for EMU_DGIEN                  */
#define EMU_DGIEN_EM23WAKEUPDGIEN_DEFAULT       (_EMU_DGIEN_EM23WAKEUPDGIEN_DEFAULT << 24) /**< Shifted mode DEFAULT for EMU_DGIEN          */
#define EMU_DGIEN_TEMPDGIEN                     (0x1UL << 29)                           /**< Temperature Interrupt enable                */
#define _EMU_DGIEN_TEMPDGIEN_SHIFT              29                                      /**< Shift value for EMU_TEMPDGIEN               */
#define _EMU_DGIEN_TEMPDGIEN_MASK               0x20000000UL                            /**< Bit mask for EMU_TEMPDGIEN                  */
#define _EMU_DGIEN_TEMPDGIEN_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for EMU_DGIEN                  */
#define EMU_DGIEN_TEMPDGIEN_DEFAULT             (_EMU_DGIEN_TEMPDGIEN_DEFAULT << 29)    /**< Shifted mode DEFAULT for EMU_DGIEN          */
#define EMU_DGIEN_TEMPLOWDGIEN                  (0x1UL << 30)                           /**< Temperature low Interrupt enable            */
#define _EMU_DGIEN_TEMPLOWDGIEN_SHIFT           30                                      /**< Shift value for EMU_TEMPLOWDGIEN            */
#define _EMU_DGIEN_TEMPLOWDGIEN_MASK            0x40000000UL                            /**< Bit mask for EMU_TEMPLOWDGIEN               */
#define _EMU_DGIEN_TEMPLOWDGIEN_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for EMU_DGIEN                  */
#define EMU_DGIEN_TEMPLOWDGIEN_DEFAULT          (_EMU_DGIEN_TEMPLOWDGIEN_DEFAULT << 30) /**< Shifted mode DEFAULT for EMU_DGIEN          */
#define EMU_DGIEN_TEMPHIGHDGIEN                 (0x1UL << 31)                           /**< Temperature high Interrupt enable           */
#define _EMU_DGIEN_TEMPHIGHDGIEN_SHIFT          31                                      /**< Shift value for EMU_TEMPHIGHDGIEN           */
#define _EMU_DGIEN_TEMPHIGHDGIEN_MASK           0x80000000UL                            /**< Bit mask for EMU_TEMPHIGHDGIEN              */
#define _EMU_DGIEN_TEMPHIGHDGIEN_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for EMU_DGIEN                  */
#define EMU_DGIEN_TEMPHIGHDGIEN_DEFAULT         (_EMU_DGIEN_TEMPHIGHDGIEN_DEFAULT << 31) /**< Shifted mode DEFAULT for EMU_DGIEN          */

/* Bit fields for EMU EFPIF */
#define _EMU_EFPIF_RESETVALUE                   0x00000000UL                            /**< Default value for EMU_EFPIF                 */
#define _EMU_EFPIF_MASK                         0x00000001UL                            /**< Mask for EMU_EFPIF                          */
#define EMU_EFPIF_EFPIF                         (0x1UL << 0)                            /**< EFP Interrupt Flag                          */
#define _EMU_EFPIF_EFPIF_SHIFT                  0                                       /**< Shift value for EMU_EFPIF                   */
#define _EMU_EFPIF_EFPIF_MASK                   0x1UL                                   /**< Bit mask for EMU_EFPIF                      */
#define _EMU_EFPIF_EFPIF_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for EMU_EFPIF                  */
#define EMU_EFPIF_EFPIF_DEFAULT                 (_EMU_EFPIF_EFPIF_DEFAULT << 0)         /**< Shifted mode DEFAULT for EMU_EFPIF          */

/* Bit fields for EMU EFPIEN */
#define _EMU_EFPIEN_RESETVALUE                  0x00000000UL                            /**< Default value for EMU_EFPIEN                */
#define _EMU_EFPIEN_MASK                        0x00000001UL                            /**< Mask for EMU_EFPIEN                         */
#define EMU_EFPIEN_EFPIEN                       (0x1UL << 0)                            /**< EFP Interrupt enable                        */
#define _EMU_EFPIEN_EFPIEN_SHIFT                0                                       /**< Shift value for EMU_EFPIEN                  */
#define _EMU_EFPIEN_EFPIEN_MASK                 0x1UL                                   /**< Bit mask for EMU_EFPIEN                     */
#define _EMU_EFPIEN_EFPIEN_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for EMU_EFPIEN                 */
#define EMU_EFPIEN_EFPIEN_DEFAULT               (_EMU_EFPIEN_EFPIEN_DEFAULT << 0)       /**< Shifted mode DEFAULT for EMU_EFPIEN         */

/** @} End of group EFR32SG23_EMU_BitFields */
/** @} End of group EFR32SG23_EMU */
/** @} End of group Parts */

#endif // EFR32SG23_EMU_H
